app/views/articles/show.html.slim

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 8]]
---
  h2 =t('comment.plural')
  - if @article.comments.size == 0