app/controllers/articles_controller.rb

  def create
    return root_path unless user_signed_in?
    @article = Article.new(article_params.merge(user: current_user))
    if @article.save
---
INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "newaa"], ["text", "advance"], ["user_id", 1], ["created_at", "2015-01-07 13:05:30.296246"], ["updated_at", "2015-01-07 13:05:30.296246"]]

  def update
    @article = Article.find(params[:id])
    authorize @article
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "Rails is Awesomeee!"], ["updated_at", "2015-01-06 16:08:18.366139"], ["id", 2]]

  def destroy
    if user_signed_in?
      @article = Article.find(params[:id])
      @article.delete
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]

  def last_articles_bymail
    # Agarrar ulimos articles
    # enviar email con esos articles
    # responder status: 200

    # el pluck es para obtener un atributo en particular
    articles = Article.last_created(params[:count]).pluck(:id)
---
SELECT  "articles"."id" FROM "articles"  ORDER BY "articles"."created_at" ASC LIMIT 10